app/controllers/blogs_controller.rb

  def index
    @blogs = Blog.all
---
SELECT `blogs`.* FROM `blogs`

  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save
---
INSERT INTO `blogs` (`title`, `subtitle`, `description`, `created_at`, `updated_at`) VALUES ('6 Tips for Formatting Your Blog Posts', 'Subtitle 6 Tips for Formatting Your Blog Posts', '6 Tips for Formatting Your Blog Posts6 Tips for Formatting Your Blog Posts6 Tips for Formatting Your Blog Posts6 Tips for Formatting Your Blog Posts6 Tips for Formatting Your Blog Posts6 Tips for Formatting Your Blog Posts6 Tips for Formatting Your Blog Posts6 Tips for Formatting Your Blog Posts', '2018-12-10 11:57:46.890074', '2018-12-10 11:57:46.890074')

  def update
    respond_to do |format|
      if @blog.update(blog_params)
---
UPDATE `blogs` SET `description` = '12Tips for Formatting Your Blog Posts6 Tips for Formatting Your Blog Posts6 Tips for Formatting Your Blog Posts6 Tips for Formatting Your Blog Posts6 Tips for Formatting Your Blog Posts6 Tips for Formatting Your Blog Posts6 Tips for Formatting Your Blog Posts6 Tips for Formatting Your Blog Posts', `updated_at` = '2018-12-10 11:59:24.379947' WHERE `blogs`.`id` = 1

  def destroy
    @blog.destroy
---
DELETE FROM `blogs` WHERE `blogs`.`id` = 1

    def set_blog
      @blog = Blog.find(params[:id])
---
SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 1 LIMIT 1