app/controllers/comments_controller.rb

INSERT INTO `comments` (`user_id`, `blog_id`, `description`, `created_at`, `updated_at`) VALUES (23, 23, 'sds', '2018-12-11 05:14:12.468504', '2018-12-11 05:14:12.468504')
---
  def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save