app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `email`, `phone`, `created_at`, `updated_at`) VALUES ('Plabon Asad', 'test@gmail.com', '0125555', '2018-12-10 12:24:42.345732', '2018-12-10 12:24:42.345732')
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save